fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>DefinedType.ВКМ_ДенежнаяСумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимтостьЧаса</name>
    <type>
      <types>DefinedType.ВКМ_ДенежнаяСумма</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
// МайоровАВ 250224 Нетология Начало доработки работы формы договора ((
// Добавлены реквизиты и логика работы формы в разрезе вида договора

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда

		Элм = Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"), ЭтотОбъект);
		Элм.Вид = ВидПоляФормы.ПолеВвода;
		Элм.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
		Элм.Видимость = Ложь;

		Элм = Элементы.Добавить("ОкончаниеДействияДоговора", Тип("ПолеФормы"), ЭтотОбъект);
		Элм.Вид = ВидПоляФормы.ПолеВвода;
		Элм.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
		Элм.Видимость = Ложь;

		Элм = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"), ЭтотОбъект);
		Элм.Вид = ВидПоляФормы.ПолеВвода;
		Элм.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		Элм.Видимость = Ложь;

		Элм = Элементы.Добавить("СтоимтостьЧаса", Тип("ПолеФормы"), ЭтотОбъект);
		Элм.Вид = ВидПоляФормы.ПолеВвода;
		Элм.ПутьКДанным = "Объект.ВКМ_СтоимтостьЧаса";
		Элм.Видимость = Ложь;

ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
		Элм = Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"), ЭтотОбъект);
		Элм.Вид = ВидПоляФормы.ПолеВвода;
		Элм.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
		Элм.Видимость = Истина;

		Элм = Элементы.Добавить("ОкончаниеДействияДоговора", Тип("ПолеФормы"), ЭтотОбъект);
		Элм.Вид = ВидПоляФормы.ПолеВвода;
		Элм.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
		Элм.Видимость = Истина;

		Элм = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"), ЭтотОбъект);
		Элм.Вид = ВидПоляФормы.ПолеВвода;
		Элм.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		Элм.Видимость = Истина;

		Элм = Элементы.Добавить("СтоимтостьЧаса", Тип("ПолеФормы"), ЭтотОбъект);
		Элм.Вид = ВидПоляФормы.ПолеВвода;
		Элм.ПутьКДанным = "Объект.ВКМ_СтоимтостьЧаса";
		Элм.Видимость = Истина;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Элементы.ВидДоговора.ВыделенныйТекст = "Абонентское обслуживание" Тогда

		Элм = Элементы.Найти("НачалоДействияДоговора");
		Элм.Видимость = Истина;
		Элм = Элементы.Найти("ОкончаниеДействияДоговора");
		Элм.Видимость = Истина;
		Элм = Элементы.Найти("АбонентскаяПлата");
		Элм.Видимость = Истина;
		Элм = Элементы.Найти("СтоимтостьЧаса");
		Элм.Видимость = Истина;
		
	Иначе
		
		Элм = Элементы.Найти("НачалоДействияДоговора");
		Элм.Видимость = Ложь;
		Элм = Элементы.Найти("ОкончаниеДействияДоговора");
		Элм.Видимость = Ложь;
		Элм = Элементы.Найти("АбонентскаяПлата");
		Элм.Видимость = Ложь;
		Элм = Элементы.Найти("СтоимтостьЧаса");
		Элм.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти
//#Область ОбработчикиСобытийЭлементовШапкиФормы



//&НаКлиенте
//Процедура ВидДоговораНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
//	
//	Если Элементы.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
//		
//		ОбщегоНазначенияКлиент.СообщитьПользователю("Говно");
//		
//	КонецЕсли;
//		
//КонецПроцедуры



//#КонецОбласти



//#Область ОбработчикиСобытийЭлементовТаблицыФормы<ИмяТаблицыФормы>
//// Код процедур и функций
//#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

//  )) МайоровАВ 250224 Нетология Конец доработки работы формы договора
